# HW_6_3. 
# Написать функцию, аргументы имена сотрудников, 
# возвращает словарь, 
# ключи — первые буквы имён, 
# значения — списки, содержащие имена, начинающиеся с соответствующей буквы.
# in    # "Иван", "Мария", "Петр", "Илья", "Марина", "Петр", "Алина", "Бибочка"

# out       # {'А': ['Алина'], 'Б': ['Бибочка'], 'И': ['Иван', 'Илья'], \
        #     'М': ['Марина', 'Мария'], 'П': ['Петр', 'Петр']}


input = "Иван", "Мария", "Петр", "Илья", "Марина", "Петр", "Алина", "Бибочка"


def names_dict(input):
    
    names = sorted(input)
    
    dict1 = {} 

    for name in names:
        
        if dict1.get(name[0], 0) == 0:  
            dict1[name[0]] = [name]
        else:
            dict1[name[0]].append(name)

    print('',dict1, end= '')
    return dict1

names_dict(input)
